Practicing some skills

In [23]:
# Import libraries
import pandas as pd
%matplotlib
import numpy as np
import sys

Using matplotlib backend: Qt5Agg

Formatting a data frame:

In [12]:
# set the maximum number of columns
df = pd.read_csv("2015_trip_data.csv")
pd.set_option('display.max_columns', 20) 
df.shape

(142846, 12)

In [13]:
# Get the names of the columns
df.columns

Index(['trip_id', 'starttime', 'stoptime', 'bikeid', 'tripduration',
       'from_station_name', 'to_station_name', 'from_station_id',
       'to_station_id', 'usertype', 'gender', 'birthyear'],
      dtype='object')

In [14]:
# Get the first five rows of a column by name
df['starttime'][:5]

0    10/13/2014 10:31
1    10/13/2014 10:32
2    10/13/2014 10:33
3    10/13/2014 10:34
4    10/13/2014 10:34
Name: starttime, dtype: object

In [17]:
# Get the last five rows of a column by name
df['starttime'][-5:]

142841    10/12/2015 20:41
142842    10/12/2015 20:43
142843    10/12/2015 21:03
142844    10/12/2015 21:35
142845    10/12/2015 22:45
Name: starttime, dtype: object

In [20]:
# Create categorical ranges for numerical data, you can specifiy the number of ranges you wish
# pandas.cut(x, bins, right=True, labels=None, retbins=False, precision=3, include_lowest=False)
# pandas.cut return indices of half-open bins to which each value of x belongs.
tripdurations = pd.cut(df['tripduration'], 12) # creates 12 categories or bins
tripdurations[:5]

0    (31.274, 2454.54]
1    (31.274, 2454.54]
2    (31.274, 2454.54]
3    (31.274, 2454.54]
4    (31.274, 2454.54]
Name: tripduration, dtype: category
Categories (12, object): [(31.274, 2454.54] < (2454.54, 4849.073] < (4849.073, 7243.605] < (7243.605, 9638.138] ... (19216.268, 21610.801] < (21610.801, 24005.333] < (24005.333, 26399.865] < (26399.865, 28794.398]]

In [21]:
# Look at the value counts in the ranges created above
pd.value_counts(tripdurations)

(31.274, 2454.54]         130667
(2454.54, 4849.073]         6424
(4849.073, 7243.605]        2515
(7243.605, 9638.138]        1243
(9638.138, 12032.67]         722
(12032.67, 14427.203]        409
(14427.203, 16821.735]       320
(16821.735, 19216.268]       216
(19216.268, 21610.801]       115
(21610.801, 24005.333]        86
(24005.333, 26399.865]        80
(26399.865, 28794.398]        49
Name: tripduration, dtype: int64

In [24]:
pd.cut(np.array([.2, 1.4, 2.5, 6.2, 9.7, 2.1]), 3,labels=["good","medium","bad"])

[good, good, good, medium, bad, good]
Categories (3, object): [good < medium < bad]

In [25]:
# Index into the first six columns of the first row
df.ix[0,0:6]

trip_id                              431
starttime               10/13/2014 10:31
stoptime                10/13/2014 10:48
bikeid                          SEA00298
tripduration                     985.935
from_station_name    2nd Ave & Spring St
Name: 0, dtype: object

In [29]:
# Order the data by specified column
df['stoptime'].sort_values()[:5]

20237    1/1/2015 0:23
20238    1/1/2015 0:23
20240    1/1/2015 0:44
20239    1/1/2015 0:48
20241    1/1/2015 0:48
Name: stoptime, dtype: object

In [30]:
# Sort by a column and that obtain a cross-section of that data
sorteddata = df.sort_values(['from_station_name'])
sorteddata.ix[:,0:7].head(3)  # 0:7 displays the first 7 columns

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_name,to_station_name
8585,10552,11/7/2014 8:53,11/7/2014 9:02,SEA00297,510.718,12th Ave & E Denny Way,2nd Ave & Spring St
118226,130732,8/18/2015 9:11,8/18/2015 9:17,SEA00258,318.384,12th Ave & E Denny Way,Pine St & 9th Ave
137403,151046,9/29/2015 7:40,9/29/2015 7:44,SEA00226,218.550,12th Ave & E Denny Way,Bellevue Ave & E Pine St

In [31]:
# Obtain the first three rows and first three columns of the sorted data
sorteddata.iloc[0:3,0:3]

        trip_id       starttime        stoptime
8585      10552  11/7/2014 8:53  11/7/2014 9:02
118226   130732  8/18/2015 9:11  8/18/2015 9:17
137403   151046  9/29/2015 7:40  9/29/2015 7:44

In [33]:
# Obtain value counts of specifiec column
df['to_station_name'].value_counts().head(10)

Pier 69 / Alaskan Way & Clay St                         7212
2nd Ave & Pine St                                       7189
3rd Ave & Broad St                                      5800
PATH / 9th Ave & Westlake Ave                           5390
Westlake Ave & 6th Ave                                  5328
Pine St & 9th Ave                                       4842
Occidental Park / Occidental Ave S & S Washington St    4719
Republican St & Westlake Ave N                          4680
2nd Ave & Spring St                                     4567
Seattle Aquarium / Alaskan Way S & Elliott Bay Trail    4419
Name: to_station_name, dtype: int64

In [34]:
# pandas.DatetimeIndex's attribute dayofweek is encoded: Monday=0, Sunday=6
df["from_day_of_week"] = pd.DatetimeIndex(df['starttime']).dayofweek

In [36]:
df['from_day_of_week'].value_counts()

3    21505
0    21266
4    21097
2    20748
1    20465
5    20358
6    17407
Name: from_day_of_week, dtype: int64

In [37]:
stationDayCounts = df.groupby(['from_station_id','from_day_of_week']).sum()
stationDayCounts.head(10)

                                   trip_id  tripduration  birthyear
from_station_id from_day_of_week
BT-01           0                 73219212   1087407.458   683297.0
                1                 64999095    874698.539   716551.0
                2                 61375436    748692.088   704531.0
                3                 71440581   1032376.997   745795.0
                4                 83592578   1142537.563   748348.0
                5                 98450694   2072729.019   435736.0
                6                 71798189   1441277.253   348496.0
BT-03           0                 43760254    508713.798   783005.0
                1                 45665145    548347.104   897873.0
                2                 47019881    479407.987   976895.0

In [38]:
stationDayCounts = df.groupby(['from_station_id','from_day_of_week']).count()
stationDayCounts.head(10)

                                  trip_id  starttime  stoptime  bikeid  \
from_station_id from_day_of_week
BT-01           0                     806        806       806     806
                1                     724        724       724     724
                2                     679        679       679     679
                3                     801        801       801     801
                4                     921        921       921     921
                5                    1148       1148      1148    1148
                6                     806        806       806     806
BT-03           0                     577        577       577     577
                1                     594        594       594     594
                2                     620        620       620     620

                                  tripduration  from_station_name  \
from_station_id from_day_of_week
BT-01           0                          806                806
                1                          724                724
                2                          679                679
                3                          801                801
                4                          921                921
                5                         1148               1148
                6                          806                806
BT-03           0                          577                577
                1                          594                594
                2                          620                620

                                  to_station_name  to_station_id  usertype  \
from_station_id from_day_of_week
BT-01           0                             806            806       806
                1                             724            724       724
                2                             679            679       679
                3                             801            801       801
                4                             921            921       921
                5                            1148           1148      1148
                6                             806            806       806
BT-03           0                             577            577       577
                1                             594            594       594
                2                             620            620       620

                                  gender  birthyear
from_station_id from_day_of_week
BT-01           0                    345        345
                1                    362        362
                2                    356        356
                3                    377        377
                4                    378        378
                5                    220        220
                6                    176        176
BT-03           0                    396        396
                1                    454        454
                2                    494        494

In [39]:
stationDayAvg = df.groupby(['from_station_id','from_day_of_week']).mean()
stationDayAvg.head(10)

                                       trip_id  tripduration    birthyear
from_station_id from_day_of_week
BT-01           0                 90842.694789   1349.140767  1980.571014
                1                 89777.755525   1208.147153  1979.422652
                2                 90390.921944   1102.639305  1979.019663
                3                 89189.239700   1288.860171  1978.236074
                4                 90762.842562   1240.540242  1979.756614
                5                 85758.444251   1805.513083  1980.618182
                6                 89079.638958   1788.185177  1980.090909
BT-03           0                 75840.994801    881.653029  1977.285354
                1                 76877.348485    923.143273  1977.693833
                2                 75838.517742    773.238689  1977.520243

In [48]:
df["from_date"] = pd.DatetimeIndex(df['starttime']).date
df["from_year"] = pd.DatetimeIndex(df['starttime']).year

In [52]:
# max number of rows = 142846
days = df.groupby(['from_year','from_day_of_week']).count()
days["trip_id"].sum() # 142846
days.head(10)
#days['from_day_of_week'].count().head(10)

                            trip_id  starttime  stoptime  bikeid  \
from_year from_day_of_week
2014      0                    3373       3373      3373    3373
          1                    3209       3209      3209    3209
          2                    2996       2996      2996    2996
          3                    2616       2616      2616    2616
          4                    2736       2736      2736    2736
          5                    2684       2684      2684    2684
          6                    2625       2625      2625    2625
2015      0                   17893      17893     17893   17893
          1                   17256      17256     17256   17256
          2                   17752      17752     17752   17752

                            tripduration  from_station_name  to_station_name  \
from_year from_day_of_week
2014      0                         3373               3373             3373
          1                         3209               3209             3209
          2                         2996               2996             2996
          3                         2616               2616             2616
          4                         2736               2736             2736
          5                         2684               2684             2684
          6                         2625               2625             2625
2015      0                        17893              17893            17893
          1                        17256              17256            17256
          2                        17752              17752            17752

                            from_station_id  to_station_id  usertype  gender  \
from_year from_day_of_week
2014      0                            3373           3373      3373    2542
          1                            3209           3209      3209    2465
          2                            2996           2996      2996    2372
          3                            2616           2616      2616    1977
          4                            2736           2736      2736    2013
          5                            2684           2684      2684    1239
          6                            2625           2625      2625    1271
2015      0                           17893          17893     17893   11600
          1                           17256          17256     17256   12830
          2                           17752          17752     17752   13066

                            birthyear  from_date
from_year from_day_of_week
2014      0                      2542       3373
          1                      2465       3209
          2                      2372       2996
          3                      1977       2616
          4                      2013       2736
          5                      1239       2684
          6                      1271       2625
2015      0                     11600      17893
          1                     12830      17256
          2                     13066      17752

In [86]:
df["to_day_of_week"] = pd.DatetimeIndex(df['stoptime']).dayofweek
df["to_date"] = pd.DatetimeIndex(df['stoptime']).date
df["to_year"] = pd.DatetimeIndex(df['stoptime']).year

In [98]:
fromData = df.groupby(['from_date', 'from_day_of_week', 'from_station_id'])['starttime'].count()
toData = df.groupby(['to_date', 'to_day_of_week', 'to_station_id'])['stoptime'].count()
fromData.head(5)
toData.head(5)
# list(map(operator.sub, toData, fromData))

to_date     to_day_of_week  to_station_id
2014-10-13  0               BT-01             6
                            BT-03            11
                            BT-04             3
                            BT-05             6
                            CBD-03           16
Name: stoptime, dtype: int64

In [103]:
# data = [toData, fromData]
data = pd.DataFrame([toData, fromData])
data.head(10)

          2014-10-13                                                       \
                   0
               BT-01 BT-03 BT-04 BT-05 CBD-03 CBD-05 CBD-06 CBD-07 CBD-13
stoptime         NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN    NaN
starttime        NaN   NaN   NaN   NaN    NaN    NaN    NaN    NaN    NaN

                 ...  2015-10-12                                            \
                 ...           0
          CH-01  ...       UD-02 UD-04 UD-07 UW-02 UW-04 UW-06 UW-07 UW-10
stoptime    NaN  ...         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
starttime   NaN  ...         NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN



          WF-01 WF-04
stoptime    NaN   NaN
starttime   NaN   NaN

[2 rows x 17893 columns]

In [71]:
df.starttime.apply(lambda dt: dt.starttime()).groupby([df.from_station_id, df.starttime.apply(lambda dt: dt.year)]).nunique()

AttributeError: 'str' object has no attribute 'date'

In [82]:
# pd.DatetimeIndex(df['starttime']).nunique()
df.from_date.nunique()

365

In [64]:
# The Pandas way to obtain datatypes for every column
df.dtypes

trip_id                int64
starttime             object
stoptime              object
bikeid                object
tripduration         float64
from_station_name     object
to_station_name       object
from_station_id       object
to_station_id         object
usertype              object
gender                object
birthyear            float64
from_day_of_week       int32
from_date             object
from_year              int32
dtype: object

In [ ]:
num_to_weekdays = np.unique(df_original["to_day_of_week"], return_counts=True)
# (array([0, 1, 2, 3, 4, 5, 6]),
#  array([21258, 20478, 20729, 21496, 21069, 20348, 17454], dtype=int64))

In [ ]:
# numpy.unique(array, return_index=False, return_inverse=False, return_counts=False) 
# Returns sorted unique elements of an array w/ 3 optional outputs in addition to the unique elements: 
# the indices of the input array that give the unique values, the indices of the unique array that 
# reconstruct the input array, and the number of times each unique value comes up in the input array.
from_x = df_original.groupby(["from_date", "from_day_of_week"])["from_day_of_week"].count()
from_x_index = from_x.index
from_x_index[:][:]
np.unique(df_original["from_date"])
(df_original["from_date"].count())/7
# num_from_weekdays = np.unique(df_original["from_day_of_week"], return_counts=True)
# (array([0, 1, 2, 3, 4, 5, 6]),
#  array([21262, 20462, 20746, 21502, 21095, 20358, 17407], dtype=int64))

In [ ]:
##### Scipy Stats #####
# scipy.stats.binned_statistic(x, values, statistic='mean', bins=10)
# scipy.stats.binned_statistic_2d(x, y, values, statistic='mean', bins=10, range=None, expand_binnumbers=False)
# scipy.stats.binned_statistic_2d([0,1,2,3,4,5,6], 
#                                ['BT-01', 'BT-03', 'BT-04', 'BT-05', 'CBD-03', 'CBD-04', 'CBD-05'])
monday_df = df_original[df_original["to_day_of_week"] ==0] # 21258 rows × 16 columns
monday_df.index

Using groupby in a data frame:

In [3]:
# Our small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a','a','b','b','c']}

# Create dataframe
df = pd.DataFrame(d)
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [4]:
# Create group object
one = df.groupby('letter')

# Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [5]:
letterone = df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [6]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [9]:
letterone = df.groupby(['letter','one']).count()
letterone

            two
letter one
a      1      2
b      1      2
c      1      1

In [10]:
# same index
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [7]:
letterone = df.groupby(['letter','one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [8]:
# letterone's index changed
letterone.index

Int64Index([0, 1, 2], dtype='int64')

In [ ]:
# Adding the following lines to a new script will clear all variables each time you rerun the script:
from IPython import get_ipython
get_ipython().magic('reset -sf')

In [ ]:
# To erase a single variable:
# reset_selective name_variable
%reset_selective from_df_groups
%reset_selective to_df_groups

In [ ]:
###### Pandas Data Structures (3) ######
# Series is the most basic Data Structure available in Pandas. 
# This is basically a 1-dimensional labeled array. Therefore, Series have only one axis (axis == 0) called “index”. 
# Example Series object:
s1 = pd.Series([1, 90, 'hey', np.nan], index=['a', 'B', 'C', 'd'])

# DataFrames are 2-dimensional structures, with two axes, the “index” axis (axis == 0), and the “columns” axis (axis == 1). 
# DataFrames can be thought of as Python dictionaries where keys are the column labels, and values are the column Series. 
d1 = pd.DataFrame({'day': [17, 30], 'month': [1, 12], 'year': [2010, 2017]})

# Panels are 3-dimensional data structures, rarely used in comparison with DataFrames. Analogously to DataFrames, 
# they can be thought of as Python dictionaries of DataFrames. Instead of “index” and “columns”, 
# Panels’ axes are named as follow: items (axis == 0); major_axis (axis == 1); minor_axis (axis == 2)

In [ ]:
###### Combining Data Frames ######
# concat receives a list of DataFrames and uses axis = 0 (‘rows’) by default, so it sticks one DataFrame “below” 
# the ones before. If axis = 1 (‘columns’) is passed, then it will stick each DataFrame at the right side of the 
# ones before. concat, as opposed to several other methods, is only available in the main pandas namespace.
# A namespace basically is “where a method or attribute” lives.
df1 = pd.DataFrame({'a': [1]})
df2 = pd.DataFrame({'b': [2]})
df3 = pd.concat([df1, df2])

In [ ]:
###### Data Frame Methods ######

# info methods to get general info about df include:
df3.info()

# basic calculation methodss include:
# count, mean, max, min, cumsum, imax, imin, and describe 
# which does almost all of the prior calculations and presents them in a nicely formatted table.

# sorting and ranking methods: 
# to sort data based on its index, or on any column we have sort_index and sort_values.

In [ ]:
times_start = pd.DatetimeIndex(df_original['starttime'])
times_stop = pd.DatetimeIndex(df_original['stoptime'])

In [ ]:
np.unique(df_original["from_station_id"])
np.unique(df_original["to_station_id"])

In [ ]:
# numpy.unique(array, return_index=False, return_inverse=False, return_counts=False) 
# Returns sorted unique elements of an array w/ 3 optional outputs in addition to the unique elements: 
# the indices of the input array that give the unique values, the indices of the unique array that 
# reconstruct the input array, and the number of times each unique value comes up in the input array.
times_start = pd.DatetimeIndex(df_original['starttime'])
times_stop = pd.DatetimeIndex(df_original['stoptime'])
np.unique(times_start.dayofweek, return_counts=True)

# find out whether time is kept in 12 or 24 hour increments
np.unique(times_start.time) # times are reported in 24 hour blocks

In Hmk3, I initially added a column with the wrong name, but kept this for future reference about deleting or renaming rows and columns:

In [ ]:
# add column named "FromDayOfWeek", was initially planning to separate to and from
df["FromDayOfWeek"] = pd.DatetimeIndex(df['starttime']).dayofweek

# Drop a variable (column): axis=1 denotes a column, not a row
# example: df[:-3] #drops bottom 3 rows
# df.drop('FromDayOfWeek', axis=1) # considered dropping, but just want to rename it

# Renaming Columns Example: df.rename(index=str, columns={"A": "a", "C": "c"})
df.rename(columns={"FromDayOfWeek": "day_of_week"})

In [ ]:
###### Indexing and Selecting Data With Pandas ######
# .iloc[row,column]
# Select all rows by index label, 
# Example: Select all rows with index label "Arizona"
#  df.loc[:'Arizona']
# .ix is the combination of both .loc and .iloc. Integers are first considered labels, 
# but if not found, falls back on positional indexing
Monday = df_counts.ix[0]
Tuesday = df_counts.ix[1]
Tuesday.head(10)
type(Monday)

In [ ]:
days = ("Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday")
for i in len(days):
    days[i] = df_counts.groupby(level=[i])
    i += 1
days

In [ ]:
import seaborn

g = seaborn.FacetGrid(data=df_counts, col=df_counts.index.levels[0], col_wrap)
g.map(seaborn.distplot, "Delta")
seaborn.plt.show()